{"intro":"Choose the correct statement.","summaries":[{"subContentId":"9549d278-ec18-4fdd-b7bf-ef19f651c8ac","summary":["<p>Discussions of AI and safety increasingly consider the computer as a subject with agency rather than an object. This leads to the notion of computers as implicit ethical agents, whereby ethical decisions are implicit in their design.<\/p>\n","<p>Discussions of AI and safety consider the computer as an object rather than a subject with agency. Computers cannot be considered as ethical agents and ethical decisions are not implicit in their design.<\/p>\n\n<p><\/p>\n","<p>Discussions of AI and safety consider the computer as an object rather than a subject with agency. Computers cannot be considered as ethical agents, however, ethical decisions are implicit in their design.&nbsp;<\/p>\n\n<p><\/p>\n"],"tip":""},{"subContentId":"0e4736e6-6b8a-4ce8-b999-88dd001094b1","summary":["<p>The research focus in the small amount of research on bias in NMT has been exclusively on gender bias rather than on other attributes such as race or sexuality, and a number of solutions have been proposed to ‘de-bias’ the MT output.&nbsp;<\/p>\n\n<p><\/p>\n","<p>The research focus in the small amount of research on bias in NMT has been on gender bias and other attributes such as race and sexuality, and a number of solutions have been proposed to ‘de-bias’ the MT output.&nbsp;<\/p>\n\n<p><\/p>\n","<p>The research focus in the small amount of research on bias in NMT has been exclusively on gender bias rather than on other attributes such as race or sexuality, so far no solutions have been proposed to ‘de-bias’ the MT output.&nbsp;<\/p>\n\n<p><\/p>\n"],"tip":""},{"subContentId":"40d2cbac-908c-4aa5-ad85-5fbf1165e543","summary":["<p>The availability of free online MT is usually harmless, but members of the public might expect the same level of coherence and comprehensibility from machine translation as they would from a human translation.<\/p>\n\n<p><\/p>\n","<p>The availability of free online MT is usually harmless, and members of the public know not to expect the same level of coherence and comprehensibility from machine translation as they would from a human translation.<\/p>\n\n<p><\/p>\n","<p>The availability of free online MT is completely harmless, and members of the public know not to expect the same level of coherence and comprehensibility from machine translation as they would from a human translation.<\/p>\n"],"tip":""}],"overallFeedback":[{"from":0,"to":25,"feedback":"Bad Score"},{"from":26,"to":50,"feedback":"Average Score"},{"from":51,"to":75,"feedback":"Good Score"},{"from":76,"to":100,"feedback":"Great Score!"}],"solvedLabel":"Progress:","scoreLabel":"Wrong answers:","resultLabel":"Your result","labelCorrect":"Correct.","labelIncorrect":"Incorrect! Please try again.","alternativeIncorrectLabel":"Incorrect","labelCorrectAnswers":"Correct answers.","tipButtonLabel":"Show tip","scoreBarLabel":"You got :num out of :total points","progressText":"Progress :num of :total"}