{"intro":"Choose the correct statement.","summaries":[{"subContentId":"2ba72a0d-4944-4d75-9cec-ba44b794bea3","summary":["<p lang=\"en-US\">Post-editing can be categorised into two different levels: light and full.&nbsp;<\/p>\n","<p lang=\"en-US\">Post-editing can be categorised into three different levels: light, medium, and full.&nbsp;<\/p>\n","<p>Post-editing can not be categorised, the aim is always to produce human quality translation.&nbsp;<\/p>\n"],"tip":""},{"subContentId":"5e120fd1-8b4d-4391-a56b-6c843188c96d","summary":["<p lang=\"en-US\">It is generally accepted that light PE consists of essential fixes to achieve comprehensible output, while full PE is essential and nonessential fixes to achieve output comparable to human translation. <\/p>\n","<p lang=\"en-US\">It is generally accepted that light PE consists of non-essential fixes to achieve comprehensible output, while full PE is essential and non-essential fixes to achieve output comparable to human translation. <\/p>\n","<p lang=\"en-US\">It is generally accepted that light PE consists of essential fixes to achieve comprehensible output, while full PE is nonessential fixes to achieve output comparable to human translation. <\/p>\n"],"tip":""},{"subContentId":"92ba06c6-5e6d-4ab0-9ea1-4b6aff552978","summary":["<p lang=\"en-US\">These definitions are problematic, since 'essential' and 'comprehensible' are subjective concepts and depend on the end user's requirements.<\/p>\n","<p lang=\"en-US\">These definitions are not problematic, since 'essential' and 'comprehensible' are objective concepts and can be applied to any end user's requirements.<\/p>\n","<p lang=\"en-US\">These definitions are widely agreed upon, and strictly adhered to in the translation industry.<\/p>\n"],"tip":""},{"subContentId":"e3ef27b8-f971-4bc5-99ad-8b9c7680cc04","summary":["<p lang=\"en-US\">TAUS and the ISO standard outline objectives and suggestions, and taken together provide typical guidelines for PE, although they have different priorities.<\/p>\n","<p lang=\"en-US\">TAUS and the ISO standard outline objectives and suggestions, although they are contradictory and should not be applied together.<\/p>\n","<p>TAUS and the ISO standard outline objectives and suggestions, and taken together provide perfect guidelines for PE as they share the same priorities.&nbsp;<\/p>\n"],"tip":""},{"subContentId":"a0565c21-3030-4006-bf02-006170edc0ca","summary":["<p lang=\"en-US\">Levels of PE are often associated with quality, however this may not be accurate in all cases.<\/p>\n","<p lang=\"en-US\">Levels of PE are often associated with quality, and research has shown this to be accurate.&nbsp;&nbsp;<\/p>\n","<p lang=\"en-US\">Levels of PE are often associated with quality, however this is completely untrue.&nbsp;<\/p>\n"],"tip":""},{"subContentId":"b5d9170d-ae16-4e76-a31c-5ef6a5859f63","summary":["<p lang=\"en-US\">The quality of a MT output has a significant impact on the level of PE needed.<\/p>\n","<p lang=\"en-US\">The level of PE needed has a significant impact on the quality of a MT output.<\/p>\n","<p lang=\"en-US\">The quality of a MT output has almost no impact on the level of PE needed.<\/p>\n"],"tip":""},{"subContentId":"b09e8fa9-353c-467e-8909-78573fce630c","summary":["<p lang=\"en-US\">A high quality output may not need any PE to be considered adequate, or only need light PE to be considered human quality.<\/p>\n","<p lang=\"en-US\">A low quality output may not need any PE to be considered adequate, or only need light PE to be considered human quality.<\/p>\n","<p lang=\"en-US\">A high quality output should not need any PE to be considered adequate, or even light PE to be considered human quality.<\/p>\n"],"tip":""}],"overallFeedback":[{"from":0,"to":25,"feedback":"Bad score"},{"from":26,"to":50,"feedback":"Average score"},{"from":51,"to":75,"feedback":"Good score"},{"from":76,"to":100,"feedback":"Great score!"}],"solvedLabel":"Progress:","scoreLabel":"Wrong answers:","resultLabel":"Your result","labelCorrect":"Correct.","labelIncorrect":"Incorrect! Please try again.","alternativeIncorrectLabel":"Incorrect","labelCorrectAnswers":"Correct answers.","tipButtonLabel":"Show tip","scoreBarLabel":"You got :num out of :total points","progressText":"Progress :num of :total"}