{"media":{"disableImageZooming":false},"solution":{"introduction":"","sample":"<div>There is no sample solution for this exercise. You may find, however, that the success of the machine translation system might depend on how much training data there is for the language pair in question. If you are dealing with a language pair for which there is a lot of training data available (e.g. Spanish-English) then the FOMT has probably learned goods ways of handling your chosen structures. If there is very little training data available, however, then the FOMT may have been exposed to fewer good solutions.<\/div>\n"},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":false,"pointsHost":1},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p>Contrastive linguists study structural similiarities and differences between different languages. A common observation in contrastive linguistics is that some languages prefer non-finite subordinate clauses, whereas others prefer or even require finite subordinate clauses in similiar contexts. In (1a) below (adapted from Enkin and Mejías-Bikandi 2016), for example, English uses the non-finite form \"to drive\". (This type of non-finite form is known as \"the infinitive\".)&nbsp;The Spanish equivalent in (1b), however,&nbsp;uses a finite verb form, \"condujera\" (subjunctive, imperfect 1).<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>(1a)&nbsp;We asked the taxi driver to drive as quickly as possible.<\/p>\n\n<p>(1b)&nbsp;Le pedimos al taxista que condujera lo más rápido posible.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Think about systematic differences between your L1 and L2.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Create a \"test suite\" of sentences that exemplify these differences and then translate these sentences using at least one free online machine translation (FOMT) system. You can translate from your L1 into your L2, or the other way around.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>What kind of output does the FOMT engine you used produce for the kind of sentences you created?<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Can you see evidence that the system has learned how to handle the structures in question by \"observing\" what human translators do naturally?<\/p>\n"}