{"media":{"type":{"params":{"contentName":"Image","title":"Luisa grass cuttings","file":{"path":"images\/file-6239ade6be8a1.jpg","mime":"image\/jpeg","copyright":{"license":"U"},"width":1920,"height":1609},"alt":"Luisa grass cuttings"},"library":"H5P.Image 1.1","metadata":{"contentType":"Image","license":"U","title":"Luisa grass cuttings","licenseExtras":"Image carries a Pixabay license allowing for free and non-restricted usage. Author IDs at Pixabay is: 36851."},"subContentId":"2f83d577-190a-4900-a4d2-fcd763fa3a0e"},"disableImageZooming":false},"solution":{"sample":"<div>\n<div>Except for one  of the systems that seems to make a decision and stick to it for a whole paragraph (although it gets the title wrong), all the rest hesitate among recortes, cortes and esquejes providing inconsistent and inaccurate translations.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>When facing the output of generic MT systems, it is usual to have the right translation in a sentence but get it all wrong in the next one.&nbsp; &nbsp; Custom-based MT systems tend to do a better job in preserving vocabulary consistency, if properly trained, as words become univoque in a domain.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>Professional translation has also tended to sentence-based translation where context is many times missing. This is very risky and could lead to vocabulary inconsistencies if there is not a reviewing process that sees the whole translation in context.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>Context-aware MT, taking into account even documents, is gaining momentum, the main problem being the computational cost.&nbsp;<br>\n&nbsp;<\/div>\n<\/div>\n","introduction":""},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":false,"pointsHost":1},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p dir=\"ltr\">Words may have multiple meanings and vary depending on the domain.&nbsp;<\/p>\n\n<p dir=\"ltr\">Take these two paragraphs where the polysemic word “cuttings” should get the same translation within the paragraph and a different one across them. Paste them jointly or separately on a bunch of MT systems and take a look at how the word “cutting” is translated (hopefully this gets different translations in your language!).&nbsp;<\/p>\n\n<p dir=\"ltr\">&nbsp;<\/p>\n\n<p dir=\"ltr\">Input text:&nbsp;<\/p>\n\n<p dir=\"ltr\"><em>Magazine cuttings.<\/em><\/p>\n\n<p dir=\"ltr\"><em>I spent the week making a collage with cuttings about my favorite cartoon characters. Those cuttings were from the 1950s. My favorite cartoon from that time is Betty Boop. Most of my cuttings were about her.<\/em><\/p>\n\n<p dir=\"ltr\"><em>Garden cuttings.<\/em><\/p>\n\n<p dir=\"ltr\"><em>Some time ago, my father planted a cutting to grow a new tomato plant following a popular magazine tip. The cutting grew as planned, but the plant was a bit sick, so he cut it off. He bought a new magazine and cuttings to try out again.<\/em><\/p>\n\n<p dir=\"ltr\">&nbsp;<\/p>\n\n<p dir=\"ltr\">We provide MT translation into Spanish as an example:<\/p>\n\n<hr>\n<p dir=\"ltr\">MT1<\/p>\n\n<p dir=\"ltr\">Recortes de revista.<\/p>\n\n<p dir=\"ltr\">Pasé la semana haciendo un collage con recortes sobre mis personajes de dibujos animados favoritos. Esos esquejes eran de la década de 1950. Mi caricatura favorita de esa época es Betty Boop. La mayoría de mis recortes eran sobre ella.<\/p>\n\n<p dir=\"ltr\">Esquejes de jardín.<\/p>\n\n<p dir=\"ltr\">Hace algún tiempo, mi padre plantó un esqueje para cultivar una nueva planta de tomate siguiendo un popular consejo de una revista. El corte creció según lo planeado, pero la planta estaba un poco enferma, así que la cortó. Compró una revista nueva y recortes para volver a probar.<\/p>\n\n<hr>\n<p dir=\"ltr\">MT2<\/p>\n\n<p dir=\"ltr\">Recortes de revistas.<\/p>\n\n<p dir=\"ltr\">Me pasé la semana haciendo un collage con recortes de mis personajes de dibujos animados favoritos. Esos recortes eran de los años 50. Mi dibujo animado favorito de esa época es Betty Boop. La mayoría de mis recortes eran sobre ella.<\/p>\n\n<p dir=\"ltr\">Recortes de jardín.<\/p>\n\n<p dir=\"ltr\">Hace algún tiempo, mi padre plantó un esqueje para cultivar una nueva planta de tomate siguiendo el consejo de una revista popular. El esqueje creció según lo previsto, pero la planta estaba un poco enferma, así que lo cortó. Compró una nueva revista y esquejes para volver a probar.<\/p>\n\n<hr>\n<p dir=\"ltr\">MT3<\/p>\n\n<p dir=\"ltr\">Recortes de revistas.<\/p>\n\n<p dir=\"ltr\">Pasé la semana haciendo un collage con recortes sobre mis personajes de dibujos animados favoritos. Esos esquejes eran de la década de 1950. Mi caricatura favorita de esa época es Betty Boop. La mayoría de mis recortes eran sobre ella.<\/p>\n\n<p dir=\"ltr\">Esquejes de jardín.<\/p>\n\n<p dir=\"ltr\">Hace algún tiempo, mi padre plantó un esqueje para cultivar una nueva planta de tomate siguiendo un consejo de revista popular. El corte creció según lo planeado, pero la planta estaba un poco enferma, por lo que la cortó. Compró una nueva revista y cortes para probar de nuevo.<\/p>\n\n<hr>\n<p dir=\"ltr\"><br>\nSo, what happened with the word cuttings?&nbsp;Would this be a problem in professional translation? Why?<\/p>\n\n<p dir=\"ltr\">If you think about it, sentence-based work for both MT and professionals has its advantages\/disadvantages, right? Could you name a few?<\/p>\n\n<p dir=\"ltr\">Apparently this trend of considering a translation as a bunch of unrelated sentences is changing in MT. What do you think that could be a better unit for MT to prevent this behaviour? Paragraph? Document? What could be the problems?<\/p>\n","submitAnswer":"Submit","ariaCheck":"Check the answers.","ariaShowSolution":"Show the solution. You will be provided with a sample solution.","ariaRetry":"Retry the task. You can improve your previous answer if the author allowed that."}