{"intro":"Choose the correct statement.","summaries":[{"subContentId":"cfa028a5-16a0-42c4-a014-1d1ceb8d5f1a","summary":["<p>Initially, MT and post-editing for professional purposes were considered disruptive and not fully embraced. Consequently, research focused on measuring PE to verify whether or not it increased productivity.<\/p>\n","<p>MT and post-editing for professional purposes have always been considered useful innovations that could support translators. Consequently, research focused on measuring PE to confirm this belief.&nbsp;<\/p>\n","<p>Initially, MT and post-editing for professional purposes were considered disruptive and not fully embraced. Consequently, research focused on confirming that traditional translation was more efficient and provided better quality translations.<\/p>\n","<p>MT and post-editing for professional purposes have always been considered useful innovations that could support translators. Consequently, no research was done to verify this belief.&nbsp;<\/p>\n"],"tip":""},{"subContentId":"6340c6e4-2723-4d5e-a489-1fd5762d0c63","tip":"","summary":["<p>Krings' (2001) paper set the standard for measuring PE effort because it measured three dimensions of effort: temporal, technical and cognitive.<\/p>\n","<p>Krings' (2001) paper set the standard for measuring PE effort because it moved away from temporal measurements, and only measured cognitive and technical effort.<\/p>\n","<p>Krings' (2001) paper set the standard for measuring PE effort because it incorporated the Levenshtein distance for the first time in any study on PE effort.<\/p>\n","<p>Krings' (2001) paper set the standard for measuring PE effort because it introduced the TER score for the first time in any study on PE effort.<\/p>\n"]},{"subContentId":"8113b814-8f6a-48d6-88a1-b579b32bea38","summary":["<p>‘TER’, or the ‘Translation Edit Rate' is used to measure PE edit distance.<\/p>\n","<p>WER' or the 'Word Error Rate' is used to measure PE edit distance.<\/p>\n","<p>‘TER’, or the ‘Translation Error Rate' is used to measure PE edit distance.<\/p>\n","<p>‘TER’, or the ‘Translator Edit Rate' is used to measure PE edit distance.<\/p>\n"],"tip":""},{"subContentId":"7aaae983-3018-4058-9976-e09000487851","summary":["<p>Cognitive effort is the most challenging dimension to measure and, although an essential aspect of post-editing effort, is often excluded during measurement of post-editing effort as a result.&nbsp;<\/p>\n","<p>Cognitive effort is the least challenging dimension to measure and, as an essential aspect of post-editing effort, is seldom excluded during measurement of post-editing effort.<\/p>\n","<p>Cognitive effort is the most challenging dimension to measure however, as an essential aspect of post-editing effort, is never excluded during measurement of post-editing effort.<\/p>\n","<p>Cognitive effort is the most challenging dimension to measure and, since it is not considered an essential aspect of post-editing effort, is often excluded during measurement of post-editing effort.&nbsp;<\/p>\n"],"tip":""},{"subContentId":"daa7cb53-0a94-4027-aa01-f9dd925c2c4d","summary":["<p>Think aloud protocols are advantageous as they allow translators to highlight difficulties as they encounter them, although they can sometimes slow down the process of post-editing.<\/p>\n","<p>Think aloud protocols are the best way to measure cognitive effort as they allow the translator to highlight difficulties in real time.<\/p>\n","<p>Think aloud protocols are rarely used in studies as they can sometimes slow down the process of post-editing.<\/p>\n","<p>Think aloud protocols are advantageous, although they should never be used in studies as they can slow down the process of post-editing.<\/p>\n"],"tip":""},{"subContentId":"dd4c973e-907e-4a3d-92f5-eede06876869","summary":["<p>The amount of PE effort required is a good indication of the quality produced by an MT system, and therefore can be used as a form of MT quality evaluation.<\/p>\n","<p>The amount of PE effort required is not always a good indication of the quality produced by an MT system, and therefore caution is advised if using it as a form of MT quality evaluation.<\/p>\n","<p>The amount of PE effort required is a good indication of the quality produced by an MT system, but should not be used as a form of MT quality evaluation.<\/p>\n","<p>The amount of PE effort required is not always a good indication of the quality produced by an MT system, and therefore should never be used as a form of MT quality evaluation.<\/p>\n"],"tip":""}],"overallFeedback":[{"from":0,"to":25,"feedback":"Bad score"},{"from":26,"to":50,"feedback":"Average Score"},{"from":51,"to":75,"feedback":"Good Score"},{"from":76,"to":100,"feedback":"Great Score!"}],"solvedLabel":"Progress:","scoreLabel":"Wrong answers:","resultLabel":"Your result","labelCorrect":"Correct.","labelIncorrect":"Incorrect! Please try again.","alternativeIncorrectLabel":"Incorrect","labelCorrectAnswers":"Correct answers.","tipButtonLabel":"Show tip","scoreBarLabel":"You got :num out of :total points","progressText":"Progress :num of :total"}