{"media":{"disableImageZooming":false},"solution":{"introduction":"","sample":"<div>When languages make up words by stringing many units, they can do so in many combinations and therefore generate very large vocabularies. If one were to assign a specific output unit in the decoder to each word, one would end with a very large neural network, which would have lots of weights and would therefore would be very hard to train. A good method to split words in sub-word units would be able to find a small vocabulary of word pieces that could be used to build the long words in the language, keeping the size of the decoder under control. For languages that do not string together units, the importance of using sub-words is smaller.<\/div>\n"},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":false,"pointsHost":1,"minimumLength":150,"maximumLength":400},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p>Attempt this after studying section 7.1 of chapter 7 of the book.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Some languages tend to use short, invariable words while other languages make up long words by stringing smaller units. For instance, the Basque word <em>zekarzkiotenentzat<\/em> means 'for the ones who brought them to him\/her', while <em>zekarzkidatenentza<\/em><em>t<\/em> means 'for the ones that brought them to me', <em>zekarkidatenentzat<\/em> would mean 'for the ones that brought it to me', <em>zekarkidaten<\/em> would be 'brought it to me', etc.&nbsp;For what kinds of languages would the use of sub-word units in neural machine translation be most helpful?&nbsp;<\/p>\n\n<p>&nbsp;<\/p>\n","placeholderText":"Remember that neural machine translation decoders can only produce a fixed vocabulary of target units.","submitAnswer":"Submit","ariaCheck":"Check the answers.","ariaShowSolution":"Show the solution. You will be provided with a sample solution.","ariaRetry":"Retry the task. You can improve your previous answer if the author allowed that."}