{"media":{"disableImageZooming":false},"solution":{"introduction":"","sample":"<div>The statement is a very strong generalization. You may, however,&nbsp;find that you can think of contexts in which it would be morally acceptable to use MT in language learning and others in which you think it would not be morally acceptable. Make a note of these contexts.&nbsp;<\/div>\n\n<div>What if you were just using MT to help you understand a foreign-language text, for example? What if you used MT to translate a foreign text into your langauge that you will then hand up to the teacher for correction? What if you used MT to translate a text in your langauge into a foreign language?<\/div>\n\n<div>Think about the values that come into play. These values could include honesty and transparency. Is it dishonest<strong> <\/strong>to use MT in writing an essay for your homework, for example, if the teacher has not forbidden the use of MT? Or is it always dishonest to pass off something that you didn't actually write as your own work? Is it morally defensible to allow a teacher to think that they are providing feedback on your work, when really they are evaluating the \"work\" of a free-online MT system? Who, if anyone, do you \"harm\" if you use MT?&nbsp;<\/div>\n"},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":false,"pointsHost":1},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p>Debate the following statement with your classmates: \"It is morally wrong to use machine translation in language learning.\"<\/p>\n\n<p>In the essay space below, write down the arguments that support the statement and those that do not support it.<\/p>\n\n<p>What factors influence the position you take?<\/p>\n","placeholderText":"Remember, this is a debate about what is morally right or wrong. It is thus a debate about ethics rather than the technical capabilities of machine translation."}