{"media":{"disableImageZooming":false},"solution":{"introduction":"<div>There is no correct answer to this question, but here are some things to think about:<\/div>\n","sample":"<div>Is the meaning of a word like \"dog\" what it refers to in the world? What about sentences like \"Beware of the dog!\" How can \"beware\" refer to something in the world? Does meaning have something to do with what a speaker or writer intends to say? Or with how you interpret what they say?&nbsp; Does meaning have more to do with changeable conventions than any eternal truths? Do meanings hold steady across different languages?&nbsp;&nbsp;<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>The really important thing here is that you do not take meaning for granted. If you think, for example, that translation has something to do with keeping meaning constant or creating new meanings,&nbsp;then you still need to be able to say what you mean by \"meaning\", and that's not easy. Books on semantics and the philosophy of language can help you explore these themes more. A good example is Paul Kroeger's (2019)&nbsp;<a href=\"https:\/\/langsci-press.org\/catalog\/book\/231\" target=\"_blank\">Analyzing meaning: An introduction to semantics and pragmatics<\/a>.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>&nbsp;<\/div>\n"},"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":true,"pointsHost":1,"minimumLength":10,"maximumLength":500},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p>Try to define \"meaning\" from as many perspectives that you can think of.<\/p>\n\n<p>Which of these perspectives are most useful when it comes to translation?<\/p>\n","keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":false,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"submitAnswer":"Submit","ariaCheck":"Check the answers.","ariaShowSolution":"Show the solution. You will be provided with a sample solution.","ariaRetry":"Retry the task. You can improve your previous answer if the author allowed that."}