{"intro":"<p>Choose the correct statement.<\/p>\n","summaries":[{"subContentId":"88aa3573-4a59-420f-8fa1-2d81cf0975ce","summary":["<p>Post-editing can be done in any interface where the source is visible and the output can be edited.&nbsp;<\/p>\n","<p>Post-editing must be done in a specialised tool.<\/p>\n","<p>Post-editing can be done in any text editor.<\/p>\n","<p>Post-editing can not be done in a spreadsheet.&nbsp;<\/p>\n"],"tip":""},{"subContentId":"f2a8440f-8aaa-4e38-af00-d262c7460d8b","summary":["<p>A TM tool is a software application that is used to access, edit and update the text in a TM.&nbsp;<\/p>\n","<p>A TM tool is a database that stores segments of texts that have been previously translated.<\/p>\n","<p>A TM tool is a text editor that is used to access, edit and updated the text in a TM.&nbsp;<\/p>\n","<p>A TM tool is a software application that is used to machine translate segments of text.&nbsp;<\/p>\n"],"tip":""},{"subContentId":"e31c2483-2c5e-454e-b567-a699c9c8e75f","tip":"","summary":["<p>Recent advancements in MT technology have meant that suggested segments from MT have potential to be more valuable than a 75% TM match.&nbsp;<\/p>\n","<p>High 'fuzzy' matches from the TM are always more valuable than suggested segments from MT.&nbsp;<\/p>\n","<p>Recent advancements in MT technology have meant that suggested segments from MT are considered more valuable than a 75% TM match.&nbsp;<\/p>\n","<p>High 'fuzzy' matches from the TM are usually considered equivalent to suggested segments from MT.&nbsp;<\/p>\n"]},{"subContentId":"bce3e47a-880c-4089-8382-bf0522c00d3e","summary":["<p>Research on post-editing focuses on types of edits made, the length of the task in comparison to 'from scratch' translation, quality, and cognitive effort.<\/p>\n","<p>Reseach on post-editing focuses on the length of time taken to complete each task and the types of edits made.<\/p>\n","<p>Research on post-editing only focuses on the length of time taken to complete each task.<\/p>\n","<p>Research interfaces only measure the cognitive processes involved in post-editing.<\/p>\n"],"tip":""},{"subContentId":"1bcbc88f-e234-402c-9ed9-004bd10c2807","summary":["<p>Research interfaces were developed as simplified versions of available commercial tools, to cut down expense and also avoid overly complex features that may have a negative impact on research objectives.&nbsp;<\/p>\n","<p>Research interfaces were developed as exact copies of available commercial tools, in order to provide accurate analysis of post-editing in a production environment.&nbsp;<\/p>\n","<p>Researchers prefer to use available commercial tools in order to provide accurate analysis of post-editing in a production environment.&nbsp;<\/p>\n","<p>Research interfaces were developed as simplified versions of available commerical tools to cut down expense, however as they often lack more complex features this can have a negative impact on research objectives.&nbsp;<\/p>\n"],"tip":""},{"subContentId":"e8885c8f-75b6-4449-a057-c91ecead85fc","tip":"","summary":["<p>Using adaptive MT, the MT system ‘learns’ from an edit made in the TM database and should adapt so that the same mistake is not produced by the MT system again.<\/p>\n","<p>Using adaptive MT, the TM database ‘learns’ from an edit made in the TM environment and should adapt so that the same mistake is not produced by the MT system again.<\/p>\n","<p>Using adaptive MT,&nbsp;the TM database ‘learns’ from a suggestion made by the MT system and should adapt so that the same mistake is not produced by the TM database again.<\/p>\n","<p>Using adaptive MT,&nbsp;the MT system ‘learns’ from a suggestion made by the TM database and should adapt so that the same mistake is not produced by the MT system again.<\/p>\n"]}],"overallFeedback":[{"from":0,"to":25,"feedback":"Bad score"},{"from":26,"to":50,"feedback":"Average score"},{"from":51,"to":75,"feedback":"Good score"},{"from":76,"to":100,"feedback":"Great Score!"}],"solvedLabel":"Progress:","scoreLabel":"Wrong answers:","resultLabel":"Your result","labelCorrect":"Correct.","labelIncorrect":"Incorrect! Please try again.","alternativeIncorrectLabel":"Incorrect","labelCorrectAnswers":"Correct answers.","tipButtonLabel":"Show tip","scoreBarLabel":"You got :num out of :total points","progressText":"Progress :num of :total"}