{"intro":"Choose the correct statement.","summaries":[{"subContentId":"22d78fa1-7f00-4fa8-ae6a-74ad7eeab569","summary":["<p>As the scale of large, publicly-traded translation conglomerates grows, so too does the disconnect between those making business decisions and those translating, reviewing or post-editing the text.<\/p>\n","<p>While large publicly-traded translation companies continue to grow, there remains a close relationship between those making business decisions and those translating, reviewing or post-editing the text.<\/p>\n\n<p><\/p>\n","<p>Large publicly-traded translation companies are reducing in size, which is closing the gap between those making business decisions and those translating, reviewing or post-editing the text.<\/p>\n\n<p><\/p>\n"],"tip":""},{"subContentId":"976684eb-2adb-43d7-9d68-663930b11ca3","summary":["<p>Suggestions from the industry to automate project management or use block chain to attribute authorship are not likely to improve the disparity of power between employers and translators.<\/p>\n\n<p><\/p>\n","<p>Suggestions from human translators to automate project management or use block chain to attribute authorship are not likely to improve the disparity of power between employers and translators.<\/p>\n\n<p><\/p>\n","<p>Suggestions from the industry to automate project management or use block chain to attribute authorship are attempts to improve the disparity of power between employers and translators.<\/p>\n\n<p><\/p>\n"],"tip":""},{"subContentId":"d530b010-9284-46ff-b9c6-c871bd3e985a","summary":["<p>UN Sustainable Development Goal 8 is to provide decent work and economic growth, this is relevant to MT, along with SDGs 13 and 15, which are related to environmental sustainability.&nbsp;<\/p>\n\n<p><\/p>\n","<p>UN Sustainable Development Goal 8 is to provide decent work and economic growth, this is relevant to MT, SDGs 13 and 15, which are related to environmental sustainability, are not.<\/p>\n\n<p><\/p>\n","<p>UN Sustainable Development Goals 8, 13 and 15 are all related to the provision of decent work and economic growth.<\/p>\n\n<p><\/p>\n"],"tip":""},{"subContentId":"0784f5ac-54bd-4192-9cfc-334df4736f05","summary":["<p>Strubell et al. (2019) estimate that training for one large transformer neural network model will produce almost five times the CO2 output of a car during its full lifetime.<\/p>\n","<p>Strubell et al. (2019) estimate that training for one large transformer neural network model will produce almost five times the CO2 output of an airplane during its full lifetime.<\/p>\n","<p>Strubell et al. (2019) estimate that training for one large transformer neural network model will produce almost three times the CO2 output of an airplane during its full lifetime.<\/p>\n"],"tip":""}],"overallFeedback":[{"from":0,"to":25,"feedback":"Bad Score"},{"from":26,"to":50,"feedback":"Average Score"},{"from":51,"to":75,"feedback":"Good Score"},{"from":76,"to":100,"feedback":"Great Score!"}],"solvedLabel":"Progress:","scoreLabel":"Wrong answers:","resultLabel":"Your result","labelCorrect":"Correct.","labelIncorrect":"Incorrect! Please try again.","alternativeIncorrectLabel":"Incorrect","labelCorrectAnswers":"Correct answers.","tipButtonLabel":"Show tip","scoreBarLabel":"You got :num out of :total points","progressText":"Progress :num of :total"}