{"media":{"disableImageZooming":false},"solution":{"introduction":"","sample":"<div>The statement is false. Besides the fact that something such as \"the best translation\" does not exist, the fact of using BLEU as the evaluation metric means that a better BLEU score does not necessarily imply a better translation. Your sample sentence shows you that.<\/div>\n"},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":false,"pointsHost":1,"minimumLength":150,"maximumLength":800},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p>Choose a sentence in English of more than 20 words and write down a good reference translation of it into a language of your choice. Now, use an NMT system and obtain an automatic translation of the same English sentence. Compute the number of spans of one, two, three and four words which exist in both translations. Now, fabricate a variation of the sentence generated by the NMT system that can be considered as a better translation, but that shares a smaller number of one-word, two-word, three-word and four-word spans with your reference translation. After that, justify the truth or falsehood of the following statement: \"as the training of an NMT system stops as soon as the BLEU score on the development corpus stops improving, the translations obtained by the trained system on the development set are the best possible translations that such a system may generate\".<\/p>\n","submitAnswer":"Submit","ariaCheck":"Check the answers.","ariaShowSolution":"Show the solution. You will be provided with a sample solution.","ariaRetry":"Retry the task. You can improve your previous answer if the author allowed that."}