{"intro":"<p>Choose the correct statement.<\/p>\n","summaries":[{"subContentId":"5207b409-b85a-4096-9f7c-ce24b21e3c6d","summary":["<p>According to Moorkens (2021), all stakeholders should be consulted and agree on the adoption of MT into a workflow.<\/p>\n","<p>According to Moorkens (2021), all stakeholders should not be consulted on the adoption of MT into a workflow.<\/p>\n\n<p>&nbsp;<\/p>\n","<p>According to Moorkens (2021), all stakeholders should be informed on the adoption of MT into a workflow, but they do not need to agree as the company can choose when to use it.<\/p>\n"],"tip":""},{"subContentId":"22c6ec20-7863-47be-9f64-9a7c03cabbec","summary":["<p dir=\"ltr\"><\/p>\n\n<p dir=\"ltr\">Translation stakeholders are all the agents involved in the translation process: the language service provider, freelance translators, software developers and translation clients.<\/p>\n","<p>Translation stakeholders are all the agents involved in the translation process: the language service provider, and freelance translators.<\/p>\n","<p>Translation stakeholders are all the agents involved in the translation process: the language service provider, freelance translators, translation clients, but not the software developers as their area of expertise is different.<\/p>\n"],"tip":""},{"subContentId":"ed5ebe03-c4ae-4ef8-9284-87dfdf0e6ce7","summary":["<p>Liability and confidentiality are two contractual areas relevant to the use of MT. However, the ISO standard for MT post-editing (ISO 18587) does not mention confidentiality, even if the process involves the use of MT.<\/p>\n","<p>Liability and confidentiality are two contractual areas not relevant to the use of MT.<\/p>\n","<p>The ISO standard for MT post-editing (ISO 18587) mentions liability and confidentiality as two contractual areas relevant to the use of MT.<\/p>\n"],"tip":""},{"subContentId":"0a373cce-8015-48ab-8a5e-07821bd15f4f","summary":["<p>Codes of ethics are frequently provided by translators' associations to encourage professional behaviour. However, only a few of them include the use of machine translation in translation projects, even if it is an ethical decision.<\/p>\n","<p>Codes of ethics are not provided by translators' associations as it is considered common sense to behave according to impartiality, honesty and respect for confidential material, especially when using MT in translation projects.<\/p>\n","<p>Codes of ethics are frequently provided by translators' associations to encourage professional behaviour and include the use of machine translation in translation projects, as it is an ethical decision.<\/p>\n"],"tip":""}],"overallFeedback":[{"from":0,"to":100,"feedback":"Well done!"}],"solvedLabel":"Progress:","scoreLabel":"Wrong answers:","resultLabel":"Your result","labelCorrect":"Correct.","labelIncorrect":"Incorrect! Please try again.","alternativeIncorrectLabel":"Incorrect","labelCorrectAnswers":"Correct answers.","tipButtonLabel":"Show tip","scoreBarLabel":"You got :num out of :total points","progressText":"Progress :num of :total"}