{"media":{"disableImageZooming":false},"solution":{"introduction":"","sample":""},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":false,"pointsHost":1},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p>Machine translation may be a shortcut to languages you do not know (yet). Try it out for unknown languages!<\/p>\n\n<ol>\n\t<li>Below there is the recipe for Spanish paella (in Spanish).&nbsp;&nbsp;<\/li>\n\t<li>Use machine translation to translate this recipe into English AND\/OR into your native language. Paste the machine translations in the box below. The English may help you to understand it better.<\/li>\n\t<li>Post-edit (review) the machine translation to make it more accurate and nice.<\/li>\n<\/ol>\n\n<p>[Note: This essay does not score points]<\/p>\n\n<p>Source:&nbsp;https:\/\/recetaspaella.es\/<\/p>\n\n<p><strong>Lista de ingredientes para 4 raciones de paella:&nbsp;<\/strong><\/p>\n\n<ul>\n\t<li>1 cebolla blanca, pelada y picada finamente<\/li>\n\t<li>5 cucharadas de aceite de oliva virgen extra<\/li>\n\t<li>2 dientes de ajo, machacados o picados finamente<\/li>\n\t<li>2 tomates, pelados y picados<\/li>\n\t<li>1\/2 cucharadita de azúcar<\/li>\n\t<li>Sal, al gusto<\/li>\n\t<li>1 cucharadita de pimentón<\/li>\n\t<li>Unas hebras de azafrán<\/li>\n\t<li>4 calamares pequeños, limpios<\/li>\n\t<li>2 tazas de arroz<\/li>\n\t<li>3 tazas de caldo de pescado o caldo de pollo, (o más si es necesario)<\/li>\n\t<li>250 ml de vino blanco<\/li>\n\t<li>12 gambas jumbo cocidas (sin pelar)<\/li>\n\t<li>16 mejillones, limpios<\/li>\n<\/ul>\n\n<p>&nbsp;<\/p>\n\n<p><strong>Herramientas:<\/strong><\/p>\n\n<ul>\n\t<li>Una paellera (o sartén) de 40 cm de diámetro<\/li>\n<\/ul>\n\n<p><strong>Cómo se hace una paella de marisco:<\/strong><\/p>\n\n<p>Empezamos haciendo el sofrito. Para ello, freímos la cebolla bien picada en el aceite caliente. Removemos la cebolla con una cuchara de madera frecuentemente, para que no se queme, y lo dejamos hasta que comience a tomar color.<\/p>\n\n<p>En ese momento, añadimos el ajo bien picado y, antes de que empiece a tomar color, incorporamos los tomates también picados.<\/p>\n\n<p>Agregamos el azúcar (para neutralizar la acidez del tomate), sal a nuestro gusto, el pimentón y unas hebras de azafrán.<br>\nRevolvemos todos los ingredientes y dejamos que se sofrían hasta que los tomates se reduzcan y comiencen a chisporrotear.<\/p>\n\n<p>Es el momento de cortar los calamares ya limpios. El cuerpo lo cortamos en aros y las patas las dejamos enteras. Añadimos el calamar y lo dejamos cocinar durante unos minutos.<\/p>\n\n<p>Incorporamos el arroz y lo distribuimos por toda la paellera para que los granos se adhieran a los ingredientes.<br>\nCalentamos el caldo junto con el vino en un cazo aparte, y cuando esté caliente lo vertemos en la paella.<\/p>\n\n<p>Aumentamos la temperatura y añadimos más sal. Volvemos a remover todo para que el arroz quede bien cubierto por el caldo, y cuando llegue a ebullición, bajamos la temperatura y dejamos que se cueza todo a fuego lento de 18 a 20 minutos.<\/p>\n\n<p>Es importante que durante la cocción vayamos moviendo la paellera por toda la superficie de cocción, para que el arroz se cueza uniformemente.<\/p>\n\n<p>Tras 10 minutos de cocción, incorporamos las gambas cocidas por encima hasta que se pongan de color rosa, luego le damos la vuelta para que se hagan por el otro lado.<\/p>\n\n<p>Si vemos que se necesita porque está muy seco, vertemos un poco más de caldo hacia el final de la cocción.<br>\nTras los 20 minutos, probamos el arroz y si está bien hecho apagamos el fuego y cubrimos la paellera con un trapo o papel de aluminio para que repose.<\/p>\n\n<p>Cocemos los mejillones al vapor con un dedo de agua en una cazuela con la tapa puesta, y cuando se abran, los colocamos por encima de la paella (desechamos los que no se abran).<\/p>\n\n<p>Servimos la paella tras 5 minutos de reposo.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>&nbsp;<\/p>\n","submitAnswer":"Submit","ariaCheck":"Check the answers.","ariaShowSolution":"Show the solution. You will be provided with a sample solution.","ariaRetry":"Retry the task. You can improve your previous answer if the author allowed that."}