{"media":{"disableImageZooming":false},"solution":{"introduction":"","sample":""},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":false,"pointsHost":1},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p>L’Alliance pour la santé et l’environnement (Health and Environment Alliance, HEAL), est une organisation non gouvernementale internationale à but non lucratif qui vise à améliorer la santé grâce à une politique publique promouvant un environnement plus propre et plus sain. Elle ne possède pour l’instant qu’un site web en anglais, et elle aimerait proposer un accès multilingue pour communiquer dans plusieurs langues de l’UE. Elle sollicite aujourd’hui de jeunes traducteurs formés à l’évaluation de la traduction automatique pour interroger la pertinence d’une utilisation du moteur neuronal de la Commission européenne (eTranslation), dans sa version entraînée pour des textes moins spécialisés comme les communiqués de presse (« General Text »). L’autre solution envisagée est DeepL, dans sa version gratuite puisqu’aucun des textes publiés sur le site n’est confidentiel.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Vous êtes chargés d’évaluer comparativement deux solutions de TA de votre choix (EN&gt;FR) à partir d’un extrait du communiqué de presse suivant :<\/p>\n\n<p><a href=\"https:\/\/www.env-health.org\/glyphosate-future-generations-to-pay-the-price-of-reauthorisation-of-health-harming-herbicide\/\">https:\/\/www.env-health.org\/glyphosate-future-generations-to-pay-the-price-of-reauthorisation-of-health-harming-herbicide\/<\/a> <\/p>\n","placeholderText":"You will be assessed based on  \t1.the evaluation of MT quality (combining different methods, comparing human and automatic evaluation, linking the choice of methods to the specific case studied).   \t2. the reasoned choice of an output","submitAnswer":"Submit","ariaCheck":"Check the answers.","ariaShowSolution":"Show the solution. You will be provided with a sample solution.","ariaRetry":"Retry the task. You can improve your previous answer if the author allowed that."}