{"media":{"disableImageZooming":false},"solution":{"introduction":"","sample":"<div>During training, a small development set, independent of the training set, consisting of a set of a few thousand source sentences and their reference translations is periodically translated with the neural machine translation being learnt and the output is automatically compared to the reference translations to obtain an indicator of similarity. As repeatedly exposing the neural machine translation system to the same training set may lead to 'memorization', and this is not desirable, it is a good idea to stop training when that indicator worsens instead of improving.<br>\n<br>\nBLEU may be used as a very fast indication of similarity between the machine-translated sentences and the reference sentences. BLEU measures how many one-word, two-word, three-word, and four-word stretches they have in common, and is designed to deliver a quantity between 0 (worst) and 1 (best). Ideally, BLEU should increase with training: but, after some training cycles, a decrease could be used as a signal to stop training. There are other automatic evaluation measures that can be used this way.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>&nbsp;<\/div>\n"},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":false,"pointsHost":1,"minimumLength":150,"maximumLength":400},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p>Read section 7.2 of Chapter 7 in the book. Explain, in your own words, why is it that we need a development set and what is the role of the automatic evaluation metric (such as BLEU) used.<\/p>\n","placeholderText":"Repeatedly exposing the neural machine translation system to the same training set may lead to &#039;memorization&#039; and this is not desirable."}