{"intro":"<p>Choose the correct statement.<\/p>\n","summaries":[{"subContentId":"ded40923-2c87-4f68-b38c-7045fc82a16e","summary":["<p>The Fifth Conference on Machine Translation (WMT20) includes the translation of low-resource languages to and from English, like Inuktitut and Tamil.<\/p>\n\n<p><\/p>\n","<p>The Fifth Conference on Machine Translation (WMT20) covers only the translation of European languages.<\/p>\n","<p>The Fifth Conference on Machine Translation (WMT20) does not include the translation of low-resource languages to and from English.<\/p>\n\n<p><\/p>\n"],"tip":""},{"subContentId":"7e7e01eb-3527-4202-a4e1-bf2bd4fa7b57","summary":["<p>Initially, published work on NMT was carried out by well-resourced academic research organizations in North America and Europe since cost, power, and data requirements hampered NMT advancement.<\/p>\n","<p>Initially, published work on NMT was conducted by well-resourced academic research groups in Australia and New Zealand because cost, power, and data requirements represented an obstacle for NMT development.<\/p>\n","<p>Initially, published work on NMT was conducted by well-resourced academic research groups in South America and Asia as cost, power, and data requirements were an obstacle for NMT advancement. <\/p>\n"],"tip":""},{"subContentId":"06111188-1393-48b1-bc50-0828c9b6f4cb","summary":["<p>Poorly-resourced languages could be impoverished in the long run because NMT has source language interference to a greater degree than human translation.<\/p>\n\n<p><\/p>\n","<p>Under-resourced languages could be enriched in the long term because NMT has source language interference to a greater degree than human translation.<\/p>\n\n<p><\/p>\n","<p>Because NMT has a lower level of source language interference than human translation, languages with limited resources may be enriched in the long run.<\/p>\n"],"tip":""},{"subContentId":"0607814e-9ade-451d-8348-274343241556","summary":["<p>The incorrect use of MT can worsen inequality because the availability of data and resources are not proportionate for a small number of the world's languages, and because of a lack of MT literacy.<\/p>\n","<p>The use of MT can help to establish equality because the availability of data and resources are proportionate for all the world's languages, and because everyone knows how to use it.<\/p>\n\n<p><\/p>\n","<p>Even if there is a lack of MT literacy, the availability of data and resources for all the world's languages is proportionate, and the use of MT can be beneficial. <\/p>\n"],"tip":""}],"overallFeedback":[{"from":0,"to":100,"feedback":"Well done!"}],"solvedLabel":"Progress:","scoreLabel":"Wrong answers:","resultLabel":"Your result","labelCorrect":"Correct.","labelIncorrect":"Incorrect! Please try again.","alternativeIncorrectLabel":"Incorrect","labelCorrectAnswers":"Correct answers.","tipButtonLabel":"Show tip","scoreBarLabel":"You got :num out of :total points","progressText":"Progress :num of :total"}