{"media":{"disableImageZooming":false},"solution":{"introduction":"","sample":"<div>FOMT might help you in preparing a script that you will later speak from. It is harder to think of ways in which it can support spontaneous converstation in your L2, unless you use it as a kind of dictionary.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>FOMT could be useful in the translation of subtitles on movies or videos. Even if it's not perfect FOMT might help you understand your L2 when it is spoken by others, provided, that is, you can still hear the original soundtrack.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>FOMT can be used to help you understand written texts in your L2, but if you always rely on FOMT into your L1, can you be sure that your ability to understand texts in the L2 will improve over time? Will you ever actually read a text in your L2?<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>FOMT can help you write in your L2 as long as you are able to evaluate it properly. In other words, you need to be able to identify good suggestions in FOMT output. You also need to be able to spot errors or inappropriate output, as you wouldn't like to reuse it. If you simply write in your L1, however, and then translate your L1 text into your L2 using FOMT, you will get very little practice at writing in the L2, and this is likely to impede your development as an L2 learner.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>Much of what we think about using FOMT in language learning is based on speculation as there is little longitudinal research conducted so far in the area. The longitudinal research that has been conducted, however, seems to conclude that we can get short-lived benefits from using FOMT in, for example, writing tasks in the L2, but that the benefits disappear after a relatively short time, and especially when the tool is taken away. This makes FOMT a little like other tools, such as dictionaries.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>&nbsp;<\/div>\n"},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":false,"pointsHost":1},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p>Think of the different ways in which you could use Free Online Machine Translation (FOMT) in language learning.<\/p>\n\n<p>How might these differents uses of FOMT support you in developing the following skills?:<\/p>\n\n<ul>\n\t<li>ability to speak your L2<\/li>\n\t<li>ability to understand others speaking your L2<\/li>\n\t<li>ability to understand texts written in your L2&nbsp;<\/li>\n\t<li>ability to write texts in your L2<\/li>\n\t<li>ability to mediate between speakers of your L1 and your L2<\/li>\n<\/ul>\n\n<p>Do you have any evidence to support your views, or are you just speculating?<\/p>\n\n<p>Do this activity by yourself or brainstorm with your fellow students.<\/p>\n\n<p>Use the essay box below to write down your thoughts or the thoughts of your group.<\/p>\n"}