{"taskDescription":"<p>Chapter 7 gives details on how the decoders in neural machine translation systems are used to produce the target text. This activity reviews basic concepts related to decoding and the building blocks of the target sentence. Drag the words into the correct boxes.<\/p>\n","overallFeedback":[{"from":0,"to":100}],"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","dropZoneIndex":"Drop Zone @index.","empty":"Drop Zone @index is empty.","contains":"Drop Zone @index contains draggable @draggable.","ariaDraggableIndex":"@index of @count draggables.","tipLabel":"Show tip","correctText":"Correct!","incorrectText":"Incorrect!","resetDropTitle":"Reset drop","resetDropDescription":"Are you sure you want to reset this drop zone?","grabbed":"Draggable is grabbed.","cancelledDragging":"Cancelled dragging.","correctAnswer":"Correct answer:","feedbackHeader":"Feedback","behaviour":{"enableRetry":true,"enableSolutionsButton":true,"enableCheckButton":true,"instantFeedback":false},"scoreBarLabel":"You got :num out of :total points","a11yCheck":"Check the answers. The responses will be marked as correct, incorrect, or unanswered.","a11yShowSolution":"Show the solution. The task will be marked with its correct solution.","a11yRetry":"Retry the task. Reset all responses and start the task over again.","textField":"One possible method to improve the ability of a neural machine translation system to translate *unseen* words, that is words not present in the *training* corpus is the use of a technique called *byte pair encoding*. In this technique, words are divided in *subword units* which may or may not make linguistic sense. The output neurons in the decoder do not compute *an embedding vector* but rather *the likelihood* of each possible such unit in the target *vocabulary*. While one could select just the most likely one, a procedure called *beam search* considers more than one option in each position and keeps track of the most promising output sequences.","submitAnswer":"Submit"}