{"timeline":{"defaultZoomLevel":"0","height":600,"asset":{},"date":[{"asset":{},"startDate":"1939","endDate":"1945","headline":"World War Two","text":"<p>During World War Two work began on the development of the world's first programmable general-purpose, electronic,&nbsp;digital computers. They were used mainly for military applications and cryptanalysis.<\/p>\n"},{"asset":{},"startDate":"1949","endDate":"1949","headline":"Weaver&#039;s Memorandum","text":"<p>Warren Weaver of the Rockefeller Foundation proposes the use of electronic computers to solve what he considered a \"world-wide translation problem\" in a famous memorandum that was distributed to around 200 of his acquaintances.<\/p>\n"},{"asset":{},"startDate":"1954","endDate":"1954","text":"<p>The first demonstration of a functioning machine translation system takes place at Georgetown University, in the USA,&nbsp;on 7 January 1954. Under the guidance of Léon Dostert and in cooperation with IBM, a Russian-to-English translation system is presented to the press. Many reporters express excitement about the technology, but the system is actually very limited. It is based on a vocabulary of just 250 words and a grammar of just six rules, and the demo uses a very carefully selected sample of 49 Russian sentences. Neverthelss, the demo is generally regarded as setting off the first \"hype cycle\" in the history of machine translation.<\/p>\n","headline":"The Georgetown Demo"},{"asset":{},"startDate":"1955","endDate":"1960","headline":"The Early Years of MT Research","text":"<p>Between 1954 and 1959 much enthusiastic research is conducted in the USA and elsewhere into machine translation, but it quickly becomes clear that fully automatic high-quality translation is well beyond the capacity of the available techniques and technologies. By 1960,&nbsp;the USA's first full-time machine translation researcher, Yehoshua Bar-Hillel, concludes that \"Fully automatic, high quality translation is not a reasonable goal, not even for scientific texts : : : Reasonable goals are then either fully automatic, low quality translation or partly automatic, high quality translation.\"<\/p>\n\n<p>Bar-Hillel, Y. 1960. ‘The Present Status of Automatic Translation of Languages’. <em>Advances in Computers<\/em> 1: 91–163.<\/p>\n"},{"asset":{},"startDate":"1966","endDate":"1966","headline":"The ALPAC Report","text":"<p>The Automatic Language Processing Advisory Committee (ALPAC), set up by the American government, concludes that there is \"no immediate or predictable prospect of useful machine translation\" (ALPAC 1966: 32), and government funding of machine translation research is effectively halted.<\/p>\n\n<p>ALPAC. 1966. <em>Language and Computers in Translation and Linguistics. A Report by the Automatic Language Processing Advisory Committee<\/em>. Washington, DC: National Academy of Sciences, National Research Council Publication 1416.<\/p>\n"},{"asset":{},"text":"<p>The development of machine translation systems continues at a reduced scale in the late 1960s and 1970s.<\/p>\n\n<p>Systran, founded in 1968, emerges as a significant system. It is used by NASA for Russian-English translationduring the Apollo-Soyuz space mission in 1975. In 1976, the then Commission of the European Communities starts using Systran for English–French translation.<\/p>\n","startDate":"1968","endDate":"1979","headline":"MT Development Continues"},{"asset":{},"startDate":"1980","endDate":"1989","headline":"Commercial Systems Abound","text":"<p>Commercial machine translation systems proliferate in North America and Japan especially. Some are developed for the burgeoning personal computer market. Rule-based systems are state of the art.<\/p>\n"},{"asset":{},"startDate":"1988","endDate":"1993","headline":"Statistical Machine Translation Emerges","text":"<p>A team from IBM conducts early experiments in statistical machine translation (SMT) using a parallel English-French corpus based on the bilingual proceedings, or <em>Hansards<\/em>, of the Canadian Federal Parliament. Their research is initially met with scepticism, and it takes another decade before SMT becomes state of the art.<\/p>\n"},{"asset":{},"text":"<p>The AltaVista search engine makes Systran's rule-based machine translation system available to users to translate web pages.&nbsp;<\/p>\n","headline":"Free Online Machine Translation is Born","startDate":"1997","endDate":"1997"},{"asset":{},"text":"<p>SMT dominates research in machine translation. IWSLT (the International Conference on Spoken Language Translation) starts running shared-task evaluations in 2004. WMT (the Conference on Machine Translation) follows suit in 2006. SMT proves to be the best performing type of machine translation in these shared tasks up until 2014.<\/p>\n","startDate":"2004","endDate":"2014","headline":"Statistical Machine Translation has its Heyday"},{"asset":{},"startDate":"2006","endDate":"2006","headline":"Google Translate is Launched","text":"<p>Google offers its own statistical machine translation system, Google Translate,&nbsp;to users of the Google search engine.<\/p>\n"},{"asset":{},"startDate":"2015","endDate":"2015","headline":"Neural Machine Translation Emerges","text":"<p>NMT outperforms SMT in a shared task evaluation at IWSLT.<\/p>\n"},{"asset":{},"startDate":"2016","endDate":"2016","headline":"Machine Translation goes Neural","text":"<p>In September 2016, Google starts transitioning its machine translation engines to NMT. By 2017 all major providers of machine translation services have made the transition to neural, and they have been joined by new players in the NMT market, including DeepL.<\/p>\n"},{"asset":{},"startDate":"2000","endDate":"2021","headline":"Internet Use Expands","text":"<p>Over the first two decades of the 21st Century the number of user of the internet grows from one billion in 2005, to two billion users in 2010, three billion in 2014, and over 4.66 billion users in 2021. The rapid expansion of the internet provides multiple platforms for the provision of free online machine translation.&nbsp;<\/p>\n"}],"language":"en","headline":"Machine Translation History","text":"<div>The use of digital computers to translate natural-language text was proposed after the end of World War Two. Since then, machine translation has changed radically, thanks to increased computing power, the availablity of training data for data-driven systems, and the ingenuity of system developers, among other things.&nbsp;<\/div>\n"}}