{"media":{"disableImageZooming":false,"type":{"params":{"contentName":"Image","file":{"path":"images\/file-623996970c34e.png","mime":"image\/png","copyright":{"license":"U"},"width":1363,"height":565},"alt":"To images: one showing a mask from a Venetian Carnival that translates into Spanish as máscara and another one showing an medical mask that translates into Spanish as mascarilla."},"library":"H5P.Image 1.1","metadata":{"contentType":"Image","license":"U","title":"Two images: one showing a mask from a Venetian Carnival that translates into Spanish as máscara and another one showing an medical mask that translates into Spanish as mascarilla.","defaultLanguage":"en","licenseExtras":"Images carry a Pixabay license allowing for free and non-restricted usage. Authors IDs at Pixabay are: 5598375 (Venetian mask) and 6341223 (medical mask)."},"subContentId":"6b4b41e3-af56-4fe3-a1ad-fb3713fb135c"}},"solution":{"introduction":"","sample":"<div>The in-domain system was probably trained on problematic in-domain data from the point of view of size or quality:&nbsp;<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>&nbsp;<strong> Data size<\/strong>: remember that to be able to learn a domain, the size of the in-domain data compared to other data needs to be significant.&nbsp;<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>&nbsp; <strong>Data quality<\/strong>: remember that if we depart from noisy data that is inconsistent with the domain, we will get inconsistent translations at the output of an MT system trained with them. The solution would be to get more relevant data if needed or filter out inconsistent data an retrain the system.<\/div>\n"},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":true,"ignoreScoring":false,"pointsHost":1},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p dir=\"ltr\">Take a look at this sentence: \"What kind of mask is recommended to prevent COVID-19 transmission?\"<\/p>\n\n<p dir=\"ltr\">Do you foresee any possible domain-specific issues to translate it?&nbsp;<\/p>\n\n<p dir=\"ltr\">When translating into Spanish, for example, we had an issue with the word “mask”:&nbsp;<\/p>\n\n<ul>\n\t<li aria-level=\"1\" dir=\"ltr\">\n\t<p dir=\"ltr\" role=\"presentation\">Custom MT1: ¿Qué tipo de máscara se recomienda para prevenir la transmisión COVID-19?<\/p>\n\t<\/li>\n\t<li aria-level=\"1\" dir=\"ltr\">\n\t<p dir=\"ltr\" role=\"presentation\">Generic MT2: ¿Qué tipo de mascarilla se recomienda para prevenir la transmisión de COVID-19?<\/p>\n\t<\/li>\n\t<li aria-level=\"1\" dir=\"ltr\">\n\t<p dir=\"ltr\" role=\"presentation\">Generic MT3: ¿Qué tipo de mascarilla se recomienda para evitar la transmisión del COVID-19?<\/p>\n\t<\/li>\n<\/ul>\n\n<p>&nbsp;<\/p>\n\n<p dir=\"ltr\">Even if you don't speak Spanish, you can appreciate the difference between these outputs: one got the word “mask” translated into “máscara” (wrong) and the other two into “mascarilla” (good).&nbsp;See here the difference between these two words for a Spanish-speaker person in the above images.&nbsp;<\/p>\n\n<p dir=\"ltr\">The fun fact about it is that the system that got the translation wrong is a custom MT engine, and, indeed a COVID-specific one.<\/p>\n\n<p dir=\"ltr\">Which might be the problem with this custom MT system? And which could be a possible solution?<\/p>\n\n<p>&nbsp;<\/p>\n","submitAnswer":"Submit","ariaCheck":"Check the answers.","ariaShowSolution":"Show the solution. You will be provided with a sample solution.","ariaRetry":"Retry the task. You can improve your previous answer if the author allowed that."}