{"intro":"Choose the correct statement.","summaries":[{"subContentId":"d8343764-dbe3-42dc-997d-8cc816316ed1","summary":["<p>Data that are available in huge volumes to be processed at scale are referred to as ‘big data’. In some cases, it may be legal to reuse translation data to train MT systems, but whether or not it is ethical is debated.<\/p>\n","<p>Data that are available in huge volumes to be processed at scale are referred to as ‘massive data’. It is legal and ethical to use translation data to train MT systems, as long as the data is freely available or has been paid for.<\/p>\n","<p>Data that are available in huge volumes to be processed at scale are referred to as ‘big data’. It is legal to reuse translation data, but it is unethical.<\/p>\n"],"tip":""},{"subContentId":"d300d36e-20f0-4610-8d38-fd65eac3a5df","summary":["<p>The Berne Convention forms the legal basis of copyright for translations, considering them as derivative works. Troussel and Debussche believe that an argument could be made for the ‘originality’ of a creative translation.<\/p>\n","<p>The Berne Convention outlines the legal requirements for the storage of ‘big data’. Troussel and Debussche believe that an argument could be made for the ‘originality’ of a creative translation.<\/p>\n","<p>The Berne Convention forms the legal basis of copyright for translations, considering them as original works. Troussel and Debussche believe that translations are, in fact, derivative.<\/p>\n"],"tip":""},{"subContentId":"20d64029-a7f9-466e-99b9-d1bd55fc59dd","summary":["<p>Certain datasets can be made freely available and distributed through projects such as Opus, due to licensing agreements or because they are covered by the EU directive 2008\/98\/EC. This does not always mean that translators have given permission for all possible forms of reuse, but they are aware that the data will be made publicly available.<\/p>\n","<p>Certain datasets can be made freely available and distributed through projects such as Opus, due to licensing agreements or because they are covered by the EU directive 2008\/98\/EC, but only if the translators have given their permission for all forms of reuse.<\/p>\n","<p>Certain datasets can be made freely available and distributed through projects such as Opus, due to licensing agreements or because they are covered by the EU directive 2008\/98\/EC, but only if the translator approves of the particular use case.<\/p>\n"],"tip":""},{"subContentId":"3a8be9b8-8c13-445b-bf2f-92da981a030e","summary":["<p>If data can render an individual identifiable, they can be considered personal data, including translation memories with named or pseuonymised creators.<\/p>\n","<p>Pseudonyms protect individuals from being identifiable in translation memories.<\/p>\n","<p>It is impossible to collect personal data from translation memories.<\/p>\n"],"tip":""},{"subContentId":"b2ed7f44-0c0c-4ae1-8432-c2ec92064809","summary":["<p>It is rare that translators can control how their translation data is reused, and there is little evidence of permission being sought for reuse of webcrawled data.<\/p>\n","<p>Translators can control how their translation data is reused, however, there is little evidence of permission being sought for reuse of webcrawled data.<\/p>\n","<p>It is rare that translators can control how their translation data is reused, although there is evidence of permission being sought for reuse of webcrawled data.<\/p>\n"],"tip":""}],"overallFeedback":[{"from":0,"to":25,"feedback":"Bad Score"},{"from":26,"to":50,"feedback":"Average Score"},{"from":51,"to":75,"feedback":"Good Score"},{"from":76,"to":100,"feedback":"Great Score!"}],"solvedLabel":"Progress:","scoreLabel":"Wrong answers:","resultLabel":"Your result","labelCorrect":"Correct.","labelIncorrect":"Incorrect! Please try again.","alternativeIncorrectLabel":"Incorrect","labelCorrectAnswers":"Correct answers.","tipButtonLabel":"Show tip","scoreBarLabel":"You got :num out of :total points","progressText":"Progress :num of :total"}