{"media":{"disableImageZooming":false},"solution":{"introduction":"","sample":"<div>1. In the French (fr), Spanish (es) and Italian (it) translations, the speaker simply \"arrives\"&nbsp;in the room or \"enters\"&nbsp;the room. We are not told specifically that they walked into the room. French, Spanish and Italian behave in a way that is typical of Romance languages. In other words, they omit information on manner of motion. German (de) is not a Romance language, but in this example it behaves like the other LOTEs, in that a very general verb \"komme\"&nbsp;that does not necessarily express manner of motion is used (with the preposition \"in\") to translation \"walk into\".&nbsp;<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>2. It doesn't really matter that none of the LOTEs specifically mention walking.&nbsp;The reader will probably assume that the speaker got to the room in question by walking, and anyway, the manner or motion will not be considered terribly relevant by most readers in the LOTEs.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>3. This is a philosophical question the answer to which depends on what you mean by \"meaning\", but if you believe that English has English meanings, French has French meanings, and so on, then it does not seem possible for a sentence in one language to mean the exact same as a sentence in another language. The two sentences might still have meanings that are very compatible with each other, however.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>If you think that sentence \"meaning\" is really about the situation that a sentence somehow describes or represents, then you might think that the LOTEs and the original English sentence all represent the same event, and that's all that matters.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>4. All of the translations in the LOTEs are good equivalents of the English sentence. In other words, they are consistent with the English sentence and function well as sentences in their respective languages. They are a fair exchange for the English sentence.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>5. There is an example of pro-drop in the Spanish sentence. No single word in the Spanish is 'equivalent' to \"he\" in the English sentence. Rather there is a \"gap\", marked by \"[ ]\" in the back translation&nbsp;<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>6. The German sentence refers to the fact that the person in question is sitting. The other LOTEs don't mention this. Nor does the English original.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>7. It is interesting to see the variety of ways in which the \"same\" relatively simple ideas can be expressed in different languages.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>&nbsp;<\/div>\n"},"keywords":[{"options":{"points":1,"occurrences":1,"caseSensitive":true,"forgiveMistakes":false,"feedbackIncludedWord":"keyword","feedbackMissedWord":"none"}}],"overallFeedback":[{"from":0,"to":100}],"behaviour":{"inputFieldSize":"10","enableRetry":false,"ignoreScoring":true,"pointsHost":1,"minimumLength":10,"maximumLength":500},"checkAnswer":"Check","tryAgain":"Retry","showSolution":"Show Solution","feedbackHeader":"Feedback","solutionTitle":"Sample solution","remainingChars":"Remaining characters: @chars","notEnoughChars":"You must enter at least @chars characters!","messageSave":"saved","ariaYourResult":"You got @score out of @total points","ariaNavigatedToSolution":"Navigated to newly included sample solution after textarea.","taskDescription":"<p>This task requires you to reflect on (1) the way human translators often describe an event in a way that is typical of the target language, even if that differs from the way the source language writer described the same event and (2) whether such different renditions can be considered of equal value to each other.<\/p>\n\n<p>The English sentence below is a real example from the Proceedings of the European Parliament (Europarl7, accessed through Sketch Engine). It is presented along with its translations into French, Spanish, Italian and German. Sentences in Languages other than English (LOTEs) are followed by simple \"back translations\" so that you can see how each of the languages handles the motion event in question.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Read the examples and answer the following questions:<\/p>\n\n<ol>\n\t<li>\n\t<p>What do the examples suggest about how the languages in question typically handle manner of motion?<\/p>\n\t<\/li>\n\t<li>\n\t<p>Does it matter if none of the LOTEs actually refer to the speaker “walking” into the room?<\/p>\n\t<\/li>\n\t<li>\n\t<p>Can the sentences still be considered to have the “same meaning” as the English sentence?<\/p>\n\t<\/li>\n\t<li>\n\t<p>Can the sentences still be considered good equivalents of the English sentence?<\/p>\n\t<\/li>\n\t<li>\n\t<p>Are there any examples of pro-drop?<\/p>\n\t<\/li>\n\t<li>\n\t<p>Does one of the LOTEs give more information than the others about the person the speaker is referring to?<\/p>\n\t<\/li>\n\t<li>\n\t<p>Do you notice anything else about the LOTEs?<\/p>\n\t<\/li>\n<\/ol>\n\n<hr>\n<p>&nbsp;<\/p>\n\n<p>en: I walk into the Chamber and here he is!<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>fr : J'arrive dans cette salle et je le vois là !<\/p>\n\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I arrive in this room and I see him there!<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>es : Entro en la Asamblea, ¡y aquí está!<\/p>\n\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I enter the Assembly and here [ ] is!<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>it: &nbsp;&nbsp;Entro in Aula e me lo trovo davanti!<\/p>\n\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I enter the Chamber and find him in front of me!<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>de: Ich komme in den Plenarsaal und da sitzt er!<\/p>\n\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I come into the Chamber and there he sits!<\/p>\n\n<hr>\n<p>&nbsp;<\/p>\n"}